/*=================================================================================
  模块名    ：SM4 实现
  文件名    ：sm4.h
  相关文件  ：无
  实现功能  ：sm4 声明
  作者      ：王彦杰
  版权：<Copyright(c) 2016-2016 Suzhou Keda Technology Co.,Ltd.All rights reserved.>
  --------------------------------------------------------------------------------
  修改记录 :    日 期        版 本      修改人  走读人      修改记录
                2016/10/09   V1.0       王彦杰              新建
                2019/04/18   V1.0       王彦杰              删除内部接口，仅保留必要的宏定义
==================================================================================*/

#ifndef HEADER_SM4_H
#define HEADER_SM4_H

#define SM4_KEY_LENGTH      16
#define SM4_BLOCK_SIZE      16
#define SM4_IV_LENGTH       (SM4_BLOCK_SIZE)

#endif

